import { Card, CardFooter, CardHeader } from '../ui/card';

const features = [
  {
    image: (
      <svg viewBox="0 0 1024 1024" className="h-20 w-20" fill="#ff3838">
        <path
          d="M768 810.7c-23.6 0-42.7-19.1-42.7-42.7s19.1-42.7 42.7-42.7c94.1 0 170.7-76.6 170.7-170.7 0-89.6-70.1-164.3-159.5-170.1L754 383l-10.7-22.7c-42.2-89.3-133-147-231.3-147s-189.1 57.7-231.3 147L270 383l-25.1 1.6c-89.5 5.8-159.5 80.5-159.5 170.1 0 94.1 76.6 170.7 170.7 170.7 23.6 0 42.7 19.1 42.7 42.7s-19.1 42.7-42.7 42.7c-141.2 0-256-114.8-256-256 0-126.1 92.5-232.5 214.7-252.4C274.8 195.7 388.9 128 512 128s237.2 67.7 297.3 174.2C931.5 322.1 1024 428.6 1024 554.7c0 141.1-114.8 256-256 256z"
          fill="#ff3838"></path>
        <path
          d="M512 938.7c-10.9 0-21.8-4.2-30.2-12.5l-128-128c-16.7-16.7-16.7-43.7 0-60.3 16.6-16.7 43.7-16.7 60.3 0l97.8 97.8 97.8-97.8c16.6-16.7 43.7-16.7 60.3 0 16.7 16.7 16.7 43.7 0 60.3l-128 128c-8.2 8.3-19.1 12.5-30 12.5z"
          fill="#ff0000"></path>
        <path
          d="M512 938.7c-23.6 0-42.7-19.1-42.7-42.7V597.3c0-23.6 19.1-42.7 42.7-42.7s42.7 19.1 42.7 42.7V896c0 23.6-19.1 42.7-42.7 42.7z"
          fill="#ff0000"></path>
      </svg>
    ),
    title: 'Швидке завантаження',
    description:
      'Знайдіть відео, яке потрібно завантажити,  скопіюйте URL-адресу.',
  },
  {
    image: (
      <svg
        className="h-20 w-20"
        viewBox="0 0 24 24"
        stroke="#ffce1f"
        fill="none"
        strokeWidth="2"
        strokeLinecap="round"
        strokeLinejoin="round">
        <path d="M17 17H4a2 2 0 01-2-2V5c0-1.5 1-2 1-2"></path>
        <path d="M22 15V5a2 2 0 00-2-2H9"></path> <path d="M8 21h8"></path>
        <path d="M12 17v4"></path> <path d="M2 2l20 20"></path>
      </svg>
    ),
    title: 'Все онлайн',
    description: 'Немає необхідності встановлювати програмне забезпечення.',
  },
  {
    image: (
      <svg
        className="h-20 w-20"
        fill="#ff3863"
        version="1.1"
        id="Layer_1"
        viewBox="0 0 512 512">
        <path d="M373.333,117.333c-76.578,0-138.667,62.081-138.667,138.667c0,53.015-42.979,96-96,96c-53.007,0-96-42.993-96-96 c0-53.021,42.985-96,96-96c13.445,0,26.452,2.74,38.454,7.985c10.796,4.718,23.373-0.209,28.091-11.005 c4.718-10.796-0.209-23.373-11.005-28.091c-17.369-7.591-36.192-11.556-55.541-11.556C62.088,117.333,0,179.414,0,256 c0,76.571,62.095,138.667,138.667,138.667c76.586,0,138.667-62.089,138.667-138.667c0-53.021,42.985-96,96-96 c53.029,0,96,42.971,96,96c0,53.015-42.979,96-96,96c-13.416,0-26.421-2.749-38.422-8.002 c-10.794-4.724-23.373,0.196-28.097,10.99c-4.724,10.794,0.196,23.373,10.99,28.097c17.369,7.602,36.195,11.582,55.53,11.582 C449.919,394.667,512,332.578,512,256C512,179.407,449.926,117.333,373.333,117.333z"></path>
      </svg>
    ),
    title: 'Безкоштовно',
    description: 'Інструмент на 100% безкоштовний і завжди буде.',
  },
];

export const FeaturesPanel = () => {
  return (
    <section id="features" className="text-center">
      <h2 className="font-manrope mt-10 text-3xl">Особливості</h2>
      <p className="mt-1 text-lg text-black dark:text-gray-400">
        Що робить нас особливими
      </p>

      <ul className="mt-5 flex flex-col items-center justify-center gap-8 md:flex-row md:flex-wrap">
        {features.map((feature, idx) => (
          <li key={idx}>
            <Card className="text-centers sm:w-[340px]">
              <CardHeader>
                <div className="flex items-center justify-center">
                  {feature.image}
                </div>
                <h3 className="text-xl font-semibold">{feature.title}</h3>
              </CardHeader>
              <CardFooter>
                <p>{feature.description}</p>
              </CardFooter>
            </Card>
          </li>
        ))}
      </ul>
    </section>
  );
};
